lxx/app/controllers/examples_controller.rb

  def index
    @examples = Example.all
---
SELECT * FROM "examples"

  def show
    @example = Example.find(params[:id])
---
SELECT * FROM "examples" WHERE ("examples"."id" = 0)